{"responseData": {"feed":{"feedUrl":"http://www.formula1.com/rss/news/latest.rss","title":"Formula1.com - Latest News","link":"http://www.formula1.com/news/headlines/","author":"","description":"All news from Formula1.com","type":"rss20","entries":[{"title":"2015 F1 game to feature in-season updates","link":"http://www.formula1.com/news/headlines/2014/7/16187.html","author":"","publishedDate":"Thu, 31 Jul 2014 09:03:00 -0700","contentSnippet":"Next year's official Formula One video game will be available on new-generation platforms and will feature live, in-season ...","content":"Next year's official Formula One video game will be available on new-generation platforms and will feature live, in-season updates for the first time, Codemasters have confirmed. \n\nThe game, which will be playable on the Xbox One, Playstation 4 and PC, will also be released earlier in the season","categories":[]},{"title":"Ferrari announce reshuffle of power unit department","link":"http://www.formula1.com/news/headlines/2014/7/16186.html","author":"","publishedDate":"Thu, 31 Jul 2014 07:29:00 -0700","contentSnippet":"Luca Marmorini is to leave his role as the director of  Ferrari's engine and electronics department as the Italian team ...","content":"Luca Marmorini is to leave his role as the director of  Ferrari's engine and electronics department as the Italian team restructure their power unit department. \n\nThe move, which was announced on Thursday, sees Mattia Binotto assume the role of chief operating officer, whilst Lorenzo Sassi retains his position as chief designer of the power unit","categories":[]},{"title":"Exclusive Vijay Mallya Q\u0026A: Force India can catch Williams","link":"http://www.formula1.com/news/headlines/2014/7/16184.html","author":"","publishedDate":"Wed, 30 Jul 2014 02:20:00 -0700","contentSnippet":"Force India have continued their tradition of punching above their weight this season, and head into the summer break lying ...","content":"Force India have continued their tradition of punching above their weight this season, and head into the summer break lying fifth in the constructors' table on 98 points - 39 up on this time last year.\n\nAlthough the team failed to score through either Nico Hulkenberg or Sergio Perez for the first time in 2014 in Hungary, team boss Vijay Mallya is confident his Mercedes-powered squad can continue to take the fight to the Formula One frontrunners","categories":[]},{"title":"Hungary analysis - Ricciardo, Alonso, Hamilton share the plaudits","link":"http://www.formula1.com/news/headlines/2014/7/16182.html","author":"","publishedDate":"Mon, 28 Jul 2014 02:21:00 -0700","contentSnippet":"Daniel Ricciardo's inspired drive to victory stole the headlines in Hungary, but the two men he beat - Fernando Alonso and ...","content":"Daniel Ricciardo's inspired drive to victory stole the headlines in Hungary, but the two men he beat - Fernando Alonso and Lewis Hamilton - also shone in a sensational finish to a breathtaking Grand Prix.\n\nFor Alonso, an astounding final stint brought him within three laps of what would have been a first triumph of 2014 - while Hamilton came agonisingly close to an unprecedented charge from pit lane to victory","categories":[]}]}}, "responseDetails": null, "responseStatus": 200}