{"responseData": {"feed":{"feedUrl":"http://www.formula1.com/rss/news/latest.rss","title":"Formula1.com - Latest News","link":"http://www.formula1.com/news/headlines/","author":"","description":"All news from Formula1.com","type":"rss20","entries":[{"title":"2015 F1 game to feature in-season updates","link":"http://www.formula1.com/news/headlines/2014/7/16187.html","author":"","publishedDate":"Thu, 31 Jul 2014 09:03:00 -0700","contentSnippet":"Next year's official Formula One video game will be available on new-generation platforms and will feature live, in-season ...","content":"Next year's official Formula One video game will be available on new-generation platforms and will feature live, in-season updates for the first time, Codemasters have confirmed. \n\nThe game, which will be playable on the Xbox One, Playstation 4 and PC, will also be released earlier in the season","categories":[]},{"title":"Ferrari announce reshuffle of power unit department","link":"http://www.formula1.com/news/headlines/2014/7/16186.html","author":"","publishedDate":"Thu, 31 Jul 2014 07:29:00 -0700","contentSnippet":"Luca Marmorini is to leave his role as the director of  Ferrari's engine and electronics department as the Italian team ...","content":"Luca Marmorini is to leave his role as the director of  Ferrari's engine and electronics department as the Italian team restructure their power unit department. \n\nThe move, which was announced on Thursday, sees Mattia Binotto assume the role of chief operating officer, whilst Lorenzo Sassi retains his position as chief designer of the power unit","categories":[]},{"title":"Exclusive Vijay Mallya Q\u0026A: Force India can catch Williams","link":"http://www.formula1.com/news/headlines/2014/7/16184.html","author":"","publishedDate":"Wed, 30 Jul 2014 02:20:00 -0700","contentSnippet":"Force India have continued their tradition of punching above their weight this season, and head into the summer break lying ...","content":"Force India have continued their tradition of punching above their weight this season, and head into the summer break lying fifth in the constructors' table on 98 points - 39 up on this time last year.\n\nAlthough the team failed to score through either Nico Hulkenberg or Sergio Perez for the first time in 2014 in Hungary, team boss Vijay Mallya is confident his Mercedes-powered squad can continue to take the fight to the Formula One frontrunners","categories":[]},{"title":"Hungary analysis - Ricciardo, Alonso, Hamilton share the plaudits","link":"http://www.formula1.com/news/headlines/2014/7/16182.html","author":"","publishedDate":"Mon, 28 Jul 2014 02:21:00 -0700","contentSnippet":"Daniel Ricciardo's inspired drive to victory stole the headlines in Hungary, but the two men he beat - Fernando Alonso and ...","content":"Daniel Ricciardo's inspired drive to victory stole the headlines in Hungary, but the two men he beat - Fernando Alonso and Lewis Hamilton - also shone in a sensational finish to a breathtaking Grand Prix.\n\nFor Alonso, an astounding final stint brought him within three laps of what would have been a first triumph of 2014 - while Hamilton came agonisingly close to an unprecedented charge from pit lane to victory","categories":[]},{"title":"Nico Rosberg Q\u0026A: Sometimes the odds are against you","link":"http://www.formula1.com/news/interviews/2014/7/16181.html","author":"","publishedDate":"Sun, 27 Jul 2014 11:32:00 -0700","contentSnippet":"Mercedes' Nico Rosberg held a commanding lead in Sunday's race at the Hungaroring until Marcus Ericsson crashed his Caterham ...","content":"Mercedes' Nico Rosberg held a commanding lead in Sunday's race at the Hungaroring until Marcus Ericsson crashed his Caterham and brought out the safety car. At that point, the German's race turned on its head. \n\nAfterwards, the world championship leader spoke to reporters about his eventful day","categories":[]},{"title":"Exclusive Christian Horner Q\u0026A: Daniel drove fantastically","link":"http://www.formula1.com/news/interviews/2014/7/16180.html","author":"","publishedDate":"Sun, 27 Jul 2014 11:09:00 -0700","contentSnippet":"Only twice have Mercedes been defeated in 2014, and on both occasions it was by Red Bull's Daniel Ricciardo.\n\nAfter watching ...","content":"Only twice have Mercedes been defeated in 2014, and on both occasions it was by Red Bull's Daniel Ricciardo.\n\nAfter watching the Australian charge to victory in Budapest, Red Bull team principal Christian Horner discussed Ricciardo's achievement, the team's season so far, and his hopes for the rest of year","categories":[]},{"title":"Hamilton 'shocked' by request to let Rosberg through","link":"http://www.formula1.com/news/headlines/2014/7/16179.html","author":"","publishedDate":"Sun, 27 Jul 2014 10:36:00 -0700","contentSnippet":"Lewis Hamilton said he was \"very shocked\" that Mercedes asked him to move aside and let team mate and title rival Nico Rosberg ...","content":"Lewis Hamilton said he was \"very shocked\" that Mercedes asked him to move aside and let team mate and title rival Nico Rosberg through at the Hungaroring.\n\nThe Briton had moved ahead of Rosberg, who started from pole, after the second round of pit stops, but the two drivers were on differing strategies","categories":[]},{"title":"FIA post-race press conference - Hungary","link":"http://www.formula1.com/news/headlines/2014/7/16178.html","author":"","publishedDate":"Sun, 27 Jul 2014 09:58:00 -0700","contentSnippet":"DRIVERS: 1 - Daniel Ricciardo (Red Bull), 2 - Fernando Alonso (Ferrari), 3 - Lewis Hamilton (Mercedes)\n\nQ: Daniel, what ...","content":"DRIVERS: 1 - Daniel Ricciardo (Red Bull), 2 - Fernando Alonso (Ferrari), 3 - Lewis Hamilton (Mercedes)\n\nQ: Daniel, what brilliant drive, congratulations. How on earth does that feel?","categories":[]},{"title":"Hungaroring stats - Ricciardo doubles up","link":"http://www.formula1.com/news/features/2014/7/16176.html","author":"","publishedDate":"Sun, 27 Jul 2014 08:53:00 -0700","contentSnippet":"In three previous races in Hungary, Daniel Ricciardo failed to break into the top ten, but on his fourth attempt the Red Bull ...","content":"In three previous races in Hungary, Daniel Ricciardo failed to break into the top ten, but on his fourth attempt the Red Bull driver got everything right, fighting his way to the front to record his second career victory.\n\nAnd just like in Canada, where he scored his first win, the Australian made the race-winning pass with three laps to go","categories":[]},{"title":"Race - Ricciardo triumphs in Hungarian thriller","link":"http://www.formula1.com/news/headlines/2014/7/16175.html","author":"","publishedDate":"Sun, 27 Jul 2014 08:28:00 -0700","contentSnippet":"Daniel Ricciardo claimed victory for Red Bull after picking off Ferrari's Fernando Alonso in a breathtaking finish to a ...","content":"Daniel Ricciardo claimed victory for Red Bull after picking off Ferrari's Fernando Alonso in a breathtaking finish to a scintillating and safety car-interrupted race at the Hungaroring on Sunday.\n\nAlonso held on to second despite late pressure from Mercedes' Lewis Hamilton, who himself had to defend as team mate and polesitter Nico Rosberg staged a lightning charge over the closing laps","categories":[]},{"title":"Race - selected team and driver quotes","link":"http://www.formula1.com/news/headlines/2014/7/16174.html","author":"","publishedDate":"Sun, 27 Jul 2014 07:51:00 -0700","contentSnippet":"Daniel Ricciardo on the elation of his late charge to a sensational victory in Hungary; Fernando Alonso on Ferrari rolling the ...","content":"Daniel Ricciardo on the elation of his late charge to a sensational victory in Hungary; Fernando Alonso on Ferrari rolling the dice and seizing their opportunities; and Jenson Button on McLaren doing likewise but losing out after electing to stay on intermediates.\n\nThe drivers and senior team personnel report back on a breathless race in Budapest...","categories":[]},{"title":"Paddock Postcard from Hungary","link":"http://www.formula1.com/news/features/2014/7/16172.html","author":"","publishedDate":"Sun, 27 Jul 2014 02:26:00 -0700","contentSnippet":"With just a week between the German and Hungarian rounds, you'd think there would be little time for those in the F1 paddock to ...","content":"With just a week between the German and Hungarian rounds, you'd think there would be little time for those in the F1 paddock to get themselves into any mischief. Mercedes, however, found a way, when what was supposed to be a 'team building' exercise turned into anything but.\n\nMembers of the team - though not the drivers - were on a group cycle ride along Vienna's River Danube","categories":[]},{"title":"Hungary - What to Watch for…","link":"http://www.formula1.com/news/features/2014/7/16171.html","author":"","publishedDate":"Sun, 27 Jul 2014 00:34:00 -0700","contentSnippet":"From Lewis Hamilton's sternest test of the season so far to the threat posed to Nico Rosberg by Red Bull, and from Sauber's ...","content":"From Lewis Hamilton's sternest test of the season so far to the threat posed to Nico Rosberg by Red Bull, and from Sauber's push for their first points of the year to Lotus's desire for a spot of rain, we break down the key themes to look out for in Sunday's Formula 1 Pirelli Magyar Nagydij 2014","categories":[]},{"title":"Qualifying analysis - Red Bulls to head Mercedes challenge","link":"http://www.formula1.com/news/features/2014/7/16170.html","author":"","publishedDate":"Sat, 26 Jul 2014 10:55:00 -0700","contentSnippet":"Once again conditions for qualifying were cooler than they had been on Friday and more in line with those from FP3, as the ...","content":"Once again conditions for qualifying were cooler than they had been on Friday and more in line with those from FP3, as the Budapest track temperature fell from an initial 47 at the start of Q1 to 40 by the end of Q3. Rain at the start of that final session was also disruptive, but the big talking point was the fire that sent Lewis Hamilton to the back of the grid for the second race in succession, leaving Red Bull in prime position to capitalise should Rosberg's luck also desert him on Sunday","categories":[]},{"title":"Hamilton, Magnussen to start from pit lane after chassis changes","link":"http://www.formula1.com/news/headlines/2014/7/16167.html","author":"","publishedDate":"Sat, 26 Jul 2014 10:15:00 -0700","contentSnippet":"Mercedes' Lewis Hamilton and McLaren's Kevin Magnussen will start Sunday's race in Hungary from the pit lane after both their ...","content":"Mercedes' Lewis Hamilton and McLaren's Kevin Magnussen will start Sunday's race in Hungary from the pit lane after both their cars sustained damage in qualifying severe enough to necessitate chassis changes.\n\nHamilton had not even set a Q1 time when he entered the pit lane with the rear of his F1 W05 Hybrid in flames","categories":[]}]}}, "responseDetails": null, "responseStatus": 200}